issue754/test1/mysql2_thr512.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 512
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            18038376
        write:                           0
        other:                           0
        total:                           18038376
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 18038376 (300399.38 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0480s
    total number of events:              334044
    total time taken by event execution: 30734.0530s
    response time:
         min:                                  8.10ms
         avg:                                 92.01ms
         max:                                818.26ms
         approx.  95 percentile:             185.33ms

Threads fairness:
    events (avg/stddev):           652.4297/33.71
    execution time (avg/stddev):   60.0274/0.01