issue754/test1/mysql2_thr64.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            17388432
        write:                           0
        other:                           0
        total:                           17388432
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 17388432 (289587.50 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0455s
    total number of events:              322008
    total time taken by event execution: 3841.2904s
    response time:
         min:                                  8.50ms
         avg:                                 11.93ms
         max:                                362.75ms
         approx.  95 percentile:              13.86ms

Threads fairness:
    events (avg/stddev):           5031.3750/470.26
    execution time (avg/stddev):   60.0202/0.02