issue754/test1/mysql2_thr8.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            3102354
        write:                           0
        other:                           0
        total:                           3102354
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 3102354 (51699.23 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0077s
    total number of events:              57451
    total time taken by event execution: 479.9994s
    response time:
         min:                                  6.69ms
         avg:                                  8.35ms
         max:                                327.35ms
         approx.  95 percentile:               8.47ms

Threads fairness:
    events (avg/stddev):           7181.3750/376.97
    execution time (avg/stddev):   59.9999/0.00