issue754/test1/proxy124_thr128.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            13409118
        write:                           0
        other:                           0
        total:                           13409118
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 13409118 (223405.37 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0215s
    total number of events:              248317
    total time taken by event execution: 7681.2784s
    response time:
         min:                                 11.30ms
         avg:                                 30.93ms
         max:                                567.24ms
         approx.  95 percentile:              40.54ms

Threads fairness:
    events (avg/stddev):           1939.9766/106.48
    execution time (avg/stddev):   60.0100/0.01