issue754/test1/proxy124_thr16.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            4848498
        write:                           0
        other:                           0
        total:                           4848498
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 4848498 (80792.01 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0121s
    total number of events:              89787
    total time taken by event execution: 960.0093s
    response time:
         min:                                  8.16ms
         avg:                                 10.69ms
         max:                                199.69ms
         approx.  95 percentile:              10.47ms

Threads fairness:
    events (avg/stddev):           5611.6875/155.07
    execution time (avg/stddev):   60.0006/0.00