issue754/test1/proxy124_thr256.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 256
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            12381390
        write:                           0
        other:                           0
        total:                           12381390
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 12381390 (206233.21 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0359s
    total number of events:              229285
    total time taken by event execution: 15364.9259s
    response time:
         min:                                 16.30ms
         avg:                                 67.01ms
         max:                                588.20ms
         approx.  95 percentile:             119.57ms

Threads fairness:
    events (avg/stddev):           895.6445/37.65
    execution time (avg/stddev):   60.0192/0.01