issue754/test1/proxy124_thr32.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            8261676
        write:                           0
        other:                           0
        total:                           8261676
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 8261676 (137671.47 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0101s
    total number of events:              152994
    total time taken by event execution: 1920.0708s
    response time:
         min:                                  8.24ms
         avg:                                 12.55ms
         max:                                464.02ms
         approx.  95 percentile:              12.64ms

Threads fairness:
    events (avg/stddev):           4781.0625/175.13
    execution time (avg/stddev):   60.0022/0.00