issue754/test1/proxy124_thr64.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            11746998
        write:                           0
        other:                           0
        total:                           11746998
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 11746998 (195740.09 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0132s
    total number of events:              217537
    total time taken by event execution: 3840.2289s
    response time:
         min:                                  9.18ms
         avg:                                 17.65ms
         max:                                383.81ms
         approx.  95 percentile:              19.77ms

Threads fairness:
    events (avg/stddev):           3399.0156/206.31
    execution time (avg/stddev):   60.0036/0.00