issue754/test1/proxy130_thr128.log
sysbench 1.0:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

OLTP test statistics:
    queries performed:
        read:                            13607514
        write:                           0
        other:                           0
        total:                           13607514
    transactions:                        0      (0.00 per sec.)
    read/write requests:                 13607514 (226721.42 per sec.)
    other operations:                    0      (0.00 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0187s
    total number of events:              251991
    total time taken by event execution: 7681.0048s
    response time:
         min:                                 11.44ms
         avg:                                 30.48ms
         max:                                391.25ms
         approx.  95 percentile:              40.62ms

Threads fairness:
    events (avg/stddev):           1968.6797/115.13
    execution time (avg/stddev):   60.0079/0.01